case/floatingObject/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }
    stationaryWalls
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }
    floatingObject
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    sides
    {
        type            empty;
    }

}


// ************************************************************************* //
