case/floatingObject/0.org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    stationaryWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    atmosphere
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    floatingObject
    {
        type            finiteVolumeBeamDisplacement;
        centreOfMass    (0.0 0.0 -0.016);
        momentOfInertia ( 0.015 0.015 0.021 );
        mass            3.148;//9.6;
        rhoInf          1;
        report          on;
        constraints
        {

        }
        restraints
        {
            beam1
            {
                sixDoFRigidBodyMotionRestraintNew finiteVolumeBeamRestraint;
                attachmentPatch right;
                initeVolumeBeamRestraintCoeffs
                {
                refAttachmentPt (0.0 0.0 -0.016);
                }
            }
        }
        value           uniform (0 0 0);
    }
    sides
    {
        type            empty;
    }

}


// ************************************************************************* //
